; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v9 ?v3)
             (pred_7 ?v12 ?v10)
             (pred_12 ?v9 ?v10)
             (pred_6 ?v11 ?v9 )
	     (pred_8 ?v9)
             (pred_5 ?v2)
             (pred_11 ?v12)
             (pred_2 ?v10)
             (pred_9 ?v9)
             (pred_4 ?v12)
             (pred_10 ?v9)
             (pred_3 ))



(:action op_4
:parameters (?v8 ?v5 ?v1 ?v7)
:precondition (and (pred_5 ?v8) (pred_5 ?v5) (pred_11 ?v1) (pred_2 ?v7)
          (pred_1 ?v8 ?v5) (pred_7 ?v1 ?v7)
                   (pred_12 ?v5 ?v7) (pred_8 ?v8) 
                   (pred_9 ?v5) (pred_4 ?v1))
:effect (and  (pred_10 ?v5) (not (pred_9 ?v5))))


(:action op_5
:parameters (?v8 ?v4)
:precondition (and (pred_5 ?v8) (pred_5 ?v4)
               (pred_8 ?v8) (pred_1 ?v8 ?v4) (pred_10 ?v4))
:effect (and (pred_8 ?v4) (not (pred_8 ?v8))))

(:action op_1
:parameters (?v8 ?v1)
:precondition (and (pred_5 ?v8) (pred_11 ?v1) 
                  (pred_8 ?v8) (pred_6 ?v1 ?v8) (pred_3 ))
:effect (and (pred_4 ?v1)
   (not (pred_6 ?v1 ?v8)) (not (pred_3 ))))


(:action op_3
:parameters (?v8 ?v13 ?v6)
:precondition (and (pred_5 ?v8) (pred_11 ?v13) (pred_11 ?v6)
                  (pred_8 ?v8) (pred_4 ?v6) (pred_6 ?v13 ?v8))
:effect (and (pred_4 ?v13) (pred_6 ?v6 ?v8)
        (not (pred_4 ?v6)) (not (pred_6 ?v13 ?v8))))

(:action op_2
:parameters (?v8 ?v1)
:precondition (and (pred_5 ?v8) (pred_11 ?v1) 
                  (pred_8 ?v8) (pred_4 ?v1))
:effect (and (pred_3 ) (pred_6 ?v1 ?v8) (not (pred_4 ?v1)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_03 obj_13 obj_15 obj_19 obj_09 obj_01 obj_12 obj_05 obj_16 obj_14 obj_11 obj_17 obj_08 obj_18 obj_04 obj_07
    obj_10 obj_20
    obj_06 obj_02
    )

    (:init
       (pred_3)

       (pred_5 obj_03)
       (pred_5 obj_13)
       (pred_5 obj_15)
       (pred_5 obj_19)
       (pred_5 obj_09)
       (pred_5 obj_01)
       (pred_5 obj_12)
       (pred_5 obj_05)
       (pred_5 obj_16)
       (pred_5 obj_14)
       (pred_5 obj_11)
       (pred_5 obj_17)
       (pred_5 obj_08)
       (pred_5 obj_18)
       (pred_5 obj_04)
       (pred_5 obj_07)
       (pred_2 obj_10)
       (pred_2 obj_20)
       (pred_11 obj_06)
       (pred_11 obj_02)

       (pred_1 obj_03 obj_09)
       (pred_1 obj_03 obj_13)
       (pred_1 obj_13 obj_01)
       (pred_1 obj_13 obj_15)
       (pred_1 obj_13 obj_03)
       (pred_1 obj_15 obj_12)
       (pred_1 obj_15 obj_19)
       (pred_1 obj_15 obj_13)
       (pred_1 obj_19 obj_05)
       (pred_1 obj_19 obj_15)
       (pred_1 obj_09 obj_16)
       (pred_1 obj_09 obj_01)
       (pred_1 obj_09 obj_03)
       (pred_1 obj_01 obj_14)
       (pred_1 obj_01 obj_12)
       (pred_1 obj_01 obj_13)
       (pred_1 obj_01 obj_09)
       (pred_1 obj_12 obj_11)
       (pred_1 obj_12 obj_05)
       (pred_1 obj_12 obj_15)
       (pred_1 obj_12 obj_01)
       (pred_1 obj_05 obj_17)
       (pred_1 obj_05 obj_19)
       (pred_1 obj_05 obj_12)
       (pred_1 obj_16 obj_08)
       (pred_1 obj_16 obj_14)
       (pred_1 obj_16 obj_09)
       (pred_1 obj_14 obj_18)
       (pred_1 obj_14 obj_11)
       (pred_1 obj_14 obj_01)
       (pred_1 obj_14 obj_16)
       (pred_1 obj_11 obj_04)
       (pred_1 obj_11 obj_17)
       (pred_1 obj_11 obj_12)
       (pred_1 obj_11 obj_14)
       (pred_1 obj_17 obj_07)
       (pred_1 obj_17 obj_05)
       (pred_1 obj_17 obj_11)
       (pred_1 obj_08 obj_18)
       (pred_1 obj_08 obj_16)
       (pred_1 obj_18 obj_04)
       (pred_1 obj_18 obj_14)
       (pred_1 obj_18 obj_08)
       (pred_1 obj_04 obj_07)
       (pred_1 obj_04 obj_11)
       (pred_1 obj_04 obj_18)
       (pred_1 obj_07 obj_17)
       (pred_1 obj_07 obj_04)
       (pred_9 obj_15)
       (pred_9 obj_12)
       (pred_12  obj_15 obj_10)
       (pred_12  obj_12 obj_20)
       (pred_10 obj_03)
       (pred_10 obj_13)
       (pred_10 obj_19)
       (pred_10 obj_09)
       (pred_10 obj_01)
       (pred_10 obj_05)
       (pred_10 obj_16)
       (pred_10 obj_14)
       (pred_10 obj_11)
       (pred_10 obj_17)
       (pred_10 obj_08)
       (pred_10 obj_18)
       (pred_10 obj_04)
       (pred_10 obj_07)

       (pred_7  obj_06 obj_10)
       (pred_7  obj_02 obj_20)
       (pred_6 obj_06 obj_13)
       (pred_6 obj_02 obj_17)
       (pred_8 obj_04)
    )

    (:goal (and
       (pred_6 obj_06 obj_05)
    ))
(:constraints
  (always (not (pred_8 obj_15)))
)
)

; plan
1. (op_5 obj_04 obj_18)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_18)
   goals met: 0 of 1
2. (op_5 obj_18 obj_14)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_14)
   goals met: 0 of 1
3. (op_5 obj_14 obj_01)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_01)
   goals met: 0 of 1
4. (op_5 obj_01 obj_13)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_13)
   goals met: 0 of 1
5. (op_1 obj_13 obj_06)
   deleted: (pred_6 obj_06 obj_13) (pred_3)
   added: (pred_4 obj_06)
   goals met: 0 of 1
6. (op_5 obj_13 obj_01)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_01)
   goals met: 0 of 1
7. (op_5 obj_01 obj_14)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_14)
   goals met: 0 of 1
8. (op_5 obj_14 obj_11)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_11)
   goals met: 0 of 1
9. (op_5 obj_11 obj_17)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_17)
   goals met: 0 of 1
10. (op_5 obj_17 obj_05)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_05)
   goals met: 0 of 1
11. (op_2 obj_05 obj_06)
   deleted: (pred_4 obj_06)
   added: (pred_3) (pred_6 obj_06 obj_05)
   goals met: 1 of 1
